---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeOptions.Dispose
source: html/ca13a4a7-ae95-a5f3-f825-5e667e6d7a17.htm
---
# Autodesk.Revit.DB.DirectShapeOptions.Dispose Method

Releases all resources used by the DirectShapeOptions

## Syntax (C#)
```csharp
public void Dispose()
```